|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [25]:
import pandas as pd
import numpy as np
tp=pd.read_csv(r'C:\Users\Admin\Desktop\joshi\dsc_weekday_2020_09_24\Assignments\Assignment_TITANIC\titanic_dataset.csv')
#print(tp)

In [12]:
#Read data and describe it
print(tp.head())
print(tp.tail())
print()
tp.describe()

   Unnamed: 0  pclass  survived  \
0           0       1         1
1           1       1         1
2           2       1         0
3           3       1         0
4           4       1         0

                                              name  gender      age  sibsp  \
0                    Allen, Miss. Elisabeth Walton  female  29.0000      0
1                   Allison, Master. Hudson Trevor    male   0.9167      1
2                     Allison, Miss. Helen Loraine  female   2.0000      1
3             Allison, Mr. Hudson Joshua Creighton    male  30.0000      1
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0000      1

   parch  ticket      fare    cabin embarked boat   body  \
0      0   24160  $211.34        B5        S    2    NaN
1      2  113781  $151.55   C22 C26        S   11    NaN
2      2  113781  $151.55   C22 C26        S  NaN    NaN
3      2  113781  $151.55   C22 C26        S  NaN  135.0
4      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON
      Unnamed: 0  pclass  survived                       name  gender   age  \
1304        1304       3         0       Zabour, Miss. Hileni  female  14.5
1305        1305       3         0      Zabour, Miss. Thamine  female   NaN
1306        1306       3         0  Zakarian, Mr. Mapriededer    male  26.5
1307        1307       3         0        Zakarian, Mr. Ortin    male  27.0
1308        1308       3         0         Zimmerman, Mr. Leo    male  29.0

      sibsp  parch  ticket     fare cabin embarked boat   body home.dest
1304      1      0    2665  $14.45    NaN        C  NaN  328.0       NaN
1305      1      0    2665  $14.45    NaN        C  NaN    NaN       NaN
1306      0      0    2656   $7.23    NaN        C  NaN  304.0       NaN
1307      0      0    2670   $7.23    NaN        C  NaN    NaN       NaN
1308      0      0  315082   $7.88    NaN        S  NaN    NaN       NaN

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [21]:
tp.isna().any()

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [26]:
#Print shape of dataset
print(tp.shape)

(1309, 15)

In [102]:
#drop columns with more than 25% missing data
print(tp.count())
print()
print(tp.count()/tp.shape[0]*100)
print()
print(tp.shape[0]*0.75)
print()
tp= tp.dropna(thresh=981, axis=1)
print(tp.count())
print()
print(tp.count()/tp.shape[0]*100)

pclass       1309
survived     1309
name         1309
gender       1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home.dest     745
dtype: int64

pclass       100.000000
survived     100.000000
name         100.000000
gender       100.000000
age           79.908327
sibsp        100.000000
parch        100.000000
ticket       100.000000
fare          99.923606
cabin         22.536287
embarked      99.847212
boat          37.127578
body           9.243697
home.dest     56.913675
dtype: float64

981.75

pclass      1309
survived    1309
name        1309
gender      1309
age         1046
sibsp       1309
parch       1309
ticket      1309
fare        1308
embarked    1307
dtype: int64

pclass      100.000000
survived    100.000000
name        100.000000
gender      100.000000
age          79.908327
sibsp       100.000000
parch       100.000000
ticket      100.000000
fare         99.923606
embarked     99.847212
dtype: float64

In [48]:
#drop columns having independent values(which do not affect the survival rate).

In [103]:
#check data types of all columns
tp.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object

In [106]:
#convert price to numeric
print(tp.ticket[~tp.ticket.str.isnumeric()])
tp.fare = tp.fare.replace(r"\$", "", regex=True).astype('float')

9               PC 17609
10              PC 17757
11              PC 17757
12              PC 17477
15              PC 17318
              ...
1284    SOTON/OQ 3101316
1292       S.O./P.P. 751
1293            A/5 2466
1295    SOTON/OQ 3101317
1297          A/4. 34244
Name: ticket, Length: 352, dtype: object

In [107]:
#•	find columns still having missing/na values and also count of missing data
tp.isna().sum()

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [111]:
#fill na with mean for fare and age column column.
tp.fillna({'fare':tp.fare.mean(), 'age':tp.age.mean()}, inplace=True)
tp.isna().sum()

pclass      0
survived    0
name        0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    2
dtype: int64

In [153]:
#drop na values for embarked column.
tp.dropna(inplace = True)
print(tp.isna().sum())
tp.shape

pclass      0
survived    0
name        0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

<ipython-input-153-75b979619455>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tp.dropna(inplace = True)

(1307, 10)

In [147]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
tp.to_csv(r'C:\Users\Admin\Desktop\joshi\dsc_weekday_2020_09_24\Assignments\Assignment_TITANIC\titanic_filtered_JB.csv')

In [150]:
pd.read_csv(r'C:\Users\Admin\Desktop\joshi\dsc_weekday_2020_09_24\Assignments\Assignment_TITANIC\titanic_filtered_JB.csv')

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.34,S
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.55,S
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.55,S
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.55,S
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.55,S
...,...,...,...,...,...,...,...,...,...,...,...
1302,1304,3,0,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.45,C
1303,1305,3,0,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.45,C
1304,1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.23,C
1305,1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.23,C
1306,1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.88,S

In [154]:
tp.shape

(1307, 10)

In [157]:
tp.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'embarked'],
      dtype='object')

In [167]:
#for surviced column replace 0 with D and 1 with A
tp.survived.replace({0:'D',1:'A'},inplace=True)
tp.to_csv(r'C:\Users\Admin\Desktop\joshi\dsc_weekday_2020_09_24\Assignments\Assignment_TITANIC\titanic_filtered_JB1.csv')

In [170]:
#find the frequency of different values in survived column
tp.survived.value_counts()

D    809
A    498
Name: survived, dtype: int64

In [191]:
#group by gender and survived and see the counts in each category
grp=tp.groupby(['gender','survived'])
print(grp.size())

gender  survived
female  A           337
        D           127
male    A           161
        D           682
dtype: int64

In [189]:
#find different pclass and no of people in each class
tp.columns
r= tp.groupby('pclass')
print(r.size())

pclass
1    321
2    277
3    709
dtype: int64

In [214]:
#find top 5 people with highest values of age. Count no of male and females in the top 5
gen_grp = tp.groupby('gender')
print(gen_grp.size())
gen_grp=gen_grp.sort('age',ascending=True).head()
print(gen_grp())

gender
female    464
male      843
dtype: int64

TypeError: 'bool' object is not callable